#LAB05 Input (การป้อนข้อมูลจากผู้ใช้)
#รับค่าผ่านทางคีบอร์ด แล้วไปเก็บไว้ในตัวแปรที่กำหนดไว้ ซึ่งรับค่าเป็น Str หรือ ข้อความเท่านั้น

Name = input("กรุณากรอกชื่อ : ")
Lastname = input("กรุณากรอกนามสกุล : ")
print("ชื่อ-สกุลของคุณคือ ",Name,Lastname)

#หากต้องการแปลงข้อมูลชนิดหนึ่งไปเป็นชนิดหนึ่ง

X = int(input("กรุณากรอกจำนวนตัวตั้งที่ 1 : "))
Y = int(input("กรุณากรอกจำนวนตัวกระทำที่ 2 : "))
print("ผลรวมมีค่าเท่ากับ ",X+Y)
print("ผลต่างมีค่าเท่ากับ ",X-Y)
print("ผลคูณค่าเท่ากับ ",X*Y)
print("ผลหารมีค่าเท่ากับ ",X/Y)
print("ผลมอตดูลัตมีค่าเท่ากับ ",str(X%Y),type(str(X%Y))) #แปลงจำนวนเต็มเป็นข้อความ


Weight = input("กรุณากรอกน้ำหนักของคุณ มีหน่วยเป็น KG : ")
Hight = float(input("กรุณากรอกน้ำหนักของคุณมีหน่วยเป็น CM : "))
BMI = float(Weight) / ((Hight/100)*(Hight/100))
print("ดัชนี BMI ของร่างกายของคุณมีค่าเท่ากับ :  ",BMI)

