#LAB08 Comparison Operators(การดำเนินการเปรียบเทียบ)
#ผลลัพธ์จะออกมาเป็น ตรรกะ

x,y = float(input("กรอกค่า x : ")),float(input("กรอกค่า y : "))
print("ค่า X คือ ",x," ค่า Y คือ ",y," ใช้ตัวดำเนินการเปรียบเทียบ == ผลลัพธ์ คือ",x==y) #เท่ากับ
print("ค่า X คือ ",x," ค่า Y คือ ",y," ใช้ตัวดำเนินการเปรียบเทียบ != ผลลัพธ์ คือ",x!=y) #ไม่เท่ากับ
print("ค่า X คือ ",x," ค่า Y คือ ",y," ใช้ตัวดำเนินการเปรียบเทียบ > ผลลัพธ์ คือ",x>y) #มากกว่า
print("ค่า X คือ ",x," ค่า Y คือ ",y," ใช้ตัวดำเนินการเปรียบเทียบ < ผลลัพธ์ คือ",x<y) #น้อยกว่า
print("ค่า X คือ ",x," ค่า Y คือ ",y," ใช้ตัวดำเนินการเปรียบเทียบ >= ผลลัพธ์ คือ",x>=y) #มากกว่าหรือเท่ากับ (เกิน)
print("ค่า X คือ ",x," ค่า Y คือ ",y," ใช้ตัวดำเนินการเปรียบเทียบ <= ผลลัพธ์ คือ",x<=y) #น้อยกว่าหรือเท่ากับ (ไม่เกิน)
