#LAB04 Variable (ตัวแปร หมายถึง ชื่อที่ถูกนิยามขึ้นที่สามารถเปลี่ยนแปลงค่าได้)
#ตัวแปรห้ามขึ้นต้นหรือลงท้ายด้วยตัวเลข หรือสัญลักษณ์พิเศษ เว้นแต่ _ (UnderScore)
#ตัวแปรห้ามเว้นวรรค หรือ Tab
#ตัวแปร อักษรพิมพ์เล็กพิมใหญ่มีความแตกต่างกัน
#ตัวแปร ห้ามสร้างซ้ำกับคำสงวนในภาษา Python

A = 1
X,Y,Z = 2,3,4.5

Name = "Peelaphat"
Lastname = "Kaewkong"

x = X+X
y = 4+30J
z = True

_xyz = "@#$%$#$##$"

print("[",Name,Lastname,"]")
print(A,X,Y,Z,Name,Lastname,x,y,z,_xyz)

#ฟังก์ชัน Type() ใช้สำหรับการตรวจสอบชนิดข้อมูลพื้นฐานของตัวแปร

print(type(A),type(X),type(Y),type(Z),type(Name),type(Lastname),type(x),type(y),type(z),type(_xyz))

#<class 'int'> หมายถึง ชนิดข้อมูลที่เก็บในตัวแปร คือ จำนวนเต็ม
#<class 'float'> หมายถึง ชนิดข้อมูลที่เก็บในตัวแปร คือ จำนวนทศนิยม
#<class 'str'> หมายถึง ชนิดข้อมูลที่เก็บในตัวแปร คือ ข้อความหรือสัญลักษณ์
#<class 'bool'> หมายถึง ชนิดข้อมูลที่เก็บในตัวแปร คือ ตรรกะ
#<class 'complex'> หมายถึง ชนิดข้อมูลที่เก็บในตัวแปร คือ จำนวนเชิงซ้อน

#แก้ไขหรืออัพเดตข้อมูลใหม่
Name = "P"
Lastname = "K"
print("[",Name,Lastname,']')

