#LAB25 String Function (ฟังก์ชันการจัดการข้อความ)

"""
"""
N = "Peelaphat"

print(N.upper()) #แปลงข้อความเป็นตัวพิมใหญ่
print(N.lower()) #แปลงข้อความเป็นตัวพิมเล็ก
print("Peelaphat".upper())
print("PEELAPHAT".lower())

print("===============================================")

print(N.startswith("Pee")) #ใช้ตรวจสอบว่าคำขึ้นต้นมีความว่า Pee หรือไม่ ผลลัพธ์จะออกมาเป็น Boolean
print("Peelaphat".startswith("Pee")) #ใช้ตรวจสอบว่าคำขึ้นต้นมีความว่า Pee หรือไม่ ผลลัพธ์จะออกมาเป็น Boolean
#ตัวอย่างการนำไปใช้งาน .startswit("<String>")
Name = input("กรุณากรอกชื่อ-นามสกุล (ใส่คำนำหน้าด้วย) : ")
if Name.startswith("นาย") == True :
    print("คุณคือเพศชาย")
elif Name.startswith("นาง"or "นางสาว") == True :
    print("คุณคือเพศหญิง")
else :
    print("คุณไม่ได้ระบุคำนำหน้าชื่อ-นามสกุล")

print("===============================================")

#ตัวอย่างการนำไปใช้งาน .endswit("<String>")
Month = input("กรุณากรอกชื่อเดือน : ")
if Month.endswith("ยนต์") == True:
    print("เดือนนี้มี 30 วัน")
elif Month.endswith("คม") == True:
    print("เดือนนี้มี 31 วัน")
elif Month.endswith("พันธ์") == True:
    print("เดือนนี้มี 28 หรือ 29 วัน")
else:
    print("ป้อนเดือนไม่ถูกต้อง")

print("===============================================")

TEXT = "Programe merrr"
print(TEXT.find("merrr")) #ค้นหาคำ โดยผลออกมาเป็น Index
print(TEXT.find("s")) #หากไม่มีผลออกมา -1
print(TEXT.count("r")) #นับจำนวนคำหรือตัวอักษร โดยผลออกมาเป็นจำนวน
print(TEXT.count("s")) #หากไม่มีเป็น 0

print("===============================================")

Text = "ปีการศึกษา 2567"
print(Text.replace("2567","2568")) #แทนที่ข้อความจาก 2567 เป็น 2568

print("================================================")
#ลบช่องว่างซ้ายขวา
t =" 00000 "
t1 =" 00000000000000"
t2 ="00000000000000 "
print(t.strip()) #ลบช่องว่างซ้ายขวา
print(t.lstrip()) #ลบช่องว่างซ้าย
print(t.rstrip()) #ลบช่องว่างขวา

print("==============================")

C = "ฉันชื่อ {0} อายุ {1} ปี".format("พีลพัทร์",24) 
print(C)

print("==============================")